{"config": [{"config": {"dtype": "float32", "output_shape_type": "raw", "batch_input_shape": [null, 75, 320, 3], "name": "lambda_1", "function_type": "lambda", "trainable": true, "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u001e<ipython-input-5-45ddad73a6b9>\u00da\b<lambda>\u000e\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}}, "class_name": "Lambda"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_1", "trainable": true, "dilation_rate": [1, 1], "use_bias": true, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5], "data_format": "channels_last", "filters": 24, "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.004000000189989805, "l1": 0.0}, "class_name": "L1L2"}, "strides": [2, 2], "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.1}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_2", "trainable": true, "dilation_rate": [1, 1], "use_bias": true, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5], "data_format": "channels_last", "filters": 36, "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.004000000189989805, "l1": 0.0}, "class_name": "L1L2"}, "strides": [2, 2], "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_3", "trainable": true, "dilation_rate": [1, 1], "use_bias": true, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5], "data_format": "channels_last", "filters": 48, "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.004000000189989805, "l1": 0.0}, "class_name": "L1L2"}, "strides": [2, 2], "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "dropout_3", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_4", "trainable": true, "dilation_rate": [1, 1], "use_bias": true, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "data_format": "channels_last", "filters": 64, "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.004000000189989805, "l1": 0.0}, "class_name": "L1L2"}, "strides": [1, 1], "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "dropout_4", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_5", "trainable": true, "dilation_rate": [1, 1], "use_bias": true, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "data_format": "channels_last", "filters": 64, "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.004000000189989805, "l1": 0.0}, "class_name": "L1L2"}, "strides": [1, 1], "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "activity_regularizer": {"config": {"l2": 0.0, "l1": 0.004000000189989805}, "class_name": "L1L2"}, "units": 1164, "name": "dense_1", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "dropout_5", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "activity_regularizer": {"config": {"l2": 0.0, "l1": 0.004000000189989805}, "class_name": "L1L2"}, "units": 100, "name": "dense_2", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "dropout_6", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "activity_regularizer": {"config": {"l2": 0.0, "l1": 0.004000000189989805}, "class_name": "L1L2"}, "units": 50, "name": "dense_3", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "dropout_7", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "activity_regularizer": {"config": {"l2": 0.0, "l1": 0.004000000189989805}, "class_name": "L1L2"}, "units": 10, "name": "dense_4", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_9"}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "dropout_8", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "activity_regularizer": null, "units": 1, "name": "dense_5", "kernel_constraint": null}, "class_name": "Dense"}], "keras_version": "2.0.5", "class_name": "Sequential", "backend": "tensorflow"}