{"keras_version": "2.0.5", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "batch_input_shape": [null, 75, 320, 3], "trainable": true, "dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u001e<ipython-input-5-0d86c413f10f>\u00da\b<lambda>\u000e\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape_type": "raw", "output_shape": null, "arguments": {}}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "conv2d_1", "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_size": [8, 8], "strides": [4, 4], "filters": 16, "bias_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.1, "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "conv2d_2", "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_size": [5, 5], "strides": [2, 2], "filters": 32, "bias_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_2", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.25, "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "conv2d_3", "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_size": [5, 5], "strides": [2, 2], "filters": 64, "bias_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_3", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "dense_1", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "units": 100, "activation": "linear"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_4", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "rate": 0.25, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "dense_2", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "units": 10, "activation": "linear"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_5", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "rate": 0.25, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "dense_3", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "units": 1, "activation": "linear"}}]}